// errorCodes.js
// Коди помилок Rainbow SCADA (WS)

module.exports = {
  ERROR: {
    0: 'невідома помилка',
    1000: 'Користувачу Відмовлено',
    1001: 'Проблема Бази Даних',
    1002: 'Проблема системи',
    1003: 'Зверніться До Постачальника Послуг',
    1004: 'Недопустимий робочий Запит',
    1005: 'Недопустимий клас Запиту',
    1006: 'Недопустимий Параметр',
    1007: 'Система Зайнята Для Користувача',
    1008: 'Система Перевантажується',
    1010: 'Багаторазовий Вхід',
    1011: 'Користувач Не Має Вузлів',
    1012: 'Користувача Не Знайдено',
    1013: 'Користувач Не Діючий',
    1014: 'Ліміт адреси',
    1030: 'Клієнт Не Має Вузлів',
    1031: 'Клієнта Не Знайдено',
    1032: 'Клієнт не діючий',
    1033: 'Клієнт Не Має Користувачів',
    1034: 'Клієнт Не Має Вузлів',
    1040: 'Кореневий вузол не знайдено',
    1041: 'Вузол не знайдено',
    1042: 'Вузол Не Діє',
    1043: 'Ім’я Вузла не заповнено',
    1044: 'Вузол Не Має Батька',
    1050: 'Ліцензію Не Знайдено',
    1051: 'Ліцензія Не Дійсна',
    1052: 'Термін Дії Ліцензії Минув',
    1053: 'Обмеження Ліцензії Користувача',
    1054: 'Обмеження Ліцензії На Пристрій',
    1080: 'Пристрій Не Знайдено,',
    1081: 'Пристрій Не Діючий',
    1082: 'Унік. ідентифікатор не діє',
    1090: 'Мову Не Знайдено',
    1091: 'Мова Не Діє',
    1100: 'Ведений Не Знайдено',
    1101: 'Ведений не діє',
    1102: 'Помилка моделі веденого',
    1103: 'Помилка шаблону веденого',
    ekran: {
      dev_param: {
        '-1006': 'Battery Appointment is Invalid'
      },
      dev_reloc: {
        101: 'Позиція Заблокована'
      },
      devx_task: {
        101: 'Пристрій Вже Ваш',
        102: 'Пристрій належить комусь іншому'
      },
      user_warn: {
        97: 'Вихід через простій !',
        98: 'Автоматичний Вихід !',
        101: 'Нерозпізнаний Запит !'
      },
      usr_paswd: {
        101: 'Пароль занадто короткий',
        102: 'Пароль занадто довгий',
        103: 'Пароль неправильний'
      }
    },
    giris: {
      usr_login: {
        100: 'Перезавантаження системи',
        101: 'Ім’я користувача не заповнено',
        102: 'Пароль не заповнено',
        103: 'Логін Недійсний',
        104: 'Пароль неправильний'
      }
    },
    iso51: {
      rpr_50001: {
        101: 'Користувацький звіт у прогресі !',
        111: 'Для дати недійсний !',
        112: 'Дата пізніша за поточну !'
      }
    },
    rapor: {
      dev_rapor: {
        101: 'Користувацький звіт у прогресі !',
        102: 'З дати не входили !',
        103: 'До дати не входили !',
        104: 'Не вибрано змінну !',
        105: 'Для дати недійсний !',
        121: 'Макс. К-сть рядків менше, ніж 1 !',
        122: '1082',
        123: 'Ємність веб-журналу заповнена !',
        124: '1081',
        125: '1102',
        126: '1103',
        127: '1101',
        128: 'Помилка веб-журналу ! '
      }
    },
    sayac: {
      dev_sayac: {
        101: 'Користувацький звіт у прогресі !',
        102: 'Компанія має вимірювачі !',
        121: 'Макс. К-сть рядків менше, ніж 1 !',
        122: '1082',
        123: 'Ємність веб-журналу заповнена !',
        124: '1081',
        125: '1102',
        126: '1103',
        127: '1101',
        128: 'Помилка веб-журналу !'
      }
    },
    yonet: {
      devx_task: {
        101: 'Пристрій Вже Ваш',
        102: 'Пристрій належить комусь іншому'
      }
    }
  }
};
